{
    "advantages_of_working_with_us": {
    "title": "Advantages of working with us",
    "descriptions": [
     {
       "project_type": "Extensive experience",
       "text": "We have already developed websites and apps for 13 years"
     },
      {
       "project_type": "Individual approach",
       "text": "We take into consideration your goals and business features"
     },
      {
       "project_type": "Security",
       "text": "We sign an NDA"
     },
      {
       "project_type": "Convenient cooperation formats",
       "text": "Full-time specialists, project work, T&M"
     },
      {
       "project_type": "Control and transparency",
       "text": "We collaborate with you at each stage of work, answer all your questions, provide prompt feedback"
     },
      {
       "project_type": "Guarantees",
       "text": "We take responsibility for the result of our work and ensure the excellent quality just in time"
     }
    ]
  },

    "how_it_staff_support": {
    "title": "Why do you need maintenance?",
    "text_title": "Our team assumes responsibility for all maintenance tasks, thereby saving you valuable time and effort that would otherwise be required for management of these tasks",
    "descriptions": [
     {
       "project_type": "Ongoing support",
       "text": "The creation of a website marks only the first stage in the process. The user experience (UX) will improve dramatically, in case the downtimes are minimized and the common bugs are fixed quickly"
     },
      {
       "project_type": "Redesign",
       "text": "This is especially true when it comes to implementing new features or performing a complete website redesign. We will assume responsibility for the redesign, promotion and development of the project"
     },
      {
       "project_type": "Сonveniently",
       "text": "Our team at Godev is always willing to be a reliable partner that helps you with website maintenance, feature integration, and any other post-launch tasks"
     },
      {
       "project_type": "Smooth operation",
       "text": "Whether it is an ecommerce website or a personal blog, it is vital to keep it available at all times. This is particularly relevant for high-traffic projects that require seamless operation under load"
     }
    ]
  },

    "how_it_staff_main": {
    "title": "IT staff augmentation",
    "text_title": "Godev offers outsourcing services: allow yourself more. Experienced programmers at affordable prices: Middle and Senior levels",
    "descriptions":
    [
     {
       "project_type": "Identify the needs",
       "text": "The first step in the staff augmentation process is assessing the specific needs of your project. This helps determine the programming skills and expertise required for successful project completion"
     },
      {
       "project_type": "Selection of candidates",
       "text": "Godev taps into its vast network of IT professionals to find candidates who precisely match your project’s requirements. These candidates are carefully vetted to ensure they possess the necessary skills and experience"
     },
      {
       "project_type": "Integration with your team",
       "text": "Once the right candidates are chosen, they are seamlessly integrated into your existing team. They work alongside your in-house staff, following your company’s processes and using your preferred tools and technologies"
     },
      {
       "project_type": "Ongoing support",
       "text": "Throughout the project, Godev provides continuous support to ensure the augmented staff meets your expectations. If needed, they are ready to provide additional resources or replace team members"
     }
    ]
  },

    "how_it_staff_outstaff": {
    "title": "How IT staff augmentation works",
    "text_title": "The staff augmentation process with Godev is straightforward and designed to be as seamless as possible. Here’s how it works:",
    "descriptions": [
          {
       "project_type": "Identify the needs",
       "text": "The first step in the staff augmentation process is assessing the specific needs of your project. This helps determine the programming skills and expertise required for successful project completion"
     },
      {
       "project_type": "Selection of candidates",
       "text": "Godev taps into its vast network of IT professionals to find candidates who precisely match your project’s requirements. These candidates are carefully vetted to ensure they possess the necessary skills and experience"
     },
      {
       "project_type": "Integration with your team",
       "text": "Once the right candidates are chosen, they are seamlessly integrated into your existing team. They work alongside your in-house staff, following your company’s processes and using your preferred tools and technologies"
     },
      {
       "project_type": "Ongoing support",
       "text": "Throughout the project, Godev provides continuous support to ensure the augmented staff meets your expectations and aligns with your business needs. If needed, we are ready to provide additional resources or replace team members"
     }
    ]
  },

    "how_it_staff_mobile": {
    "title": "We specialize in",
    "descriptions": [
     {
       "project_type": "Artificial intelligence",
       "text": "Artificial Intelligence (AI) enhances user engagement with personalized experiences, from voice recognition to predictive algorithms"
     },
      {
       "project_type": "Payment systems",
       "text": "Secure Payment Systems streamline transactions, critical for app success"
     },
      {
       "project_type": "Image and voice recognition",
       "text": "For apps needing dynamic interactions, we implement Image and Voice Recognition features, boosting usability"
     },
      {
       "project_type": "API",
       "text": "We utilize robust data sharing capabilities by incorporating third-party APIs into your pre-existing business systems. Furthermore, we develop custom APIs that are tailored to enhance the functionality and performance of your application, among other benefits"
     },
      {
       "project_type": "Frontend",
       "text": "Once the app is developed, we conduct comprehensive testing to ensure that it is bug-free and performs well under various conditions. We utilise JavaScript frameworks for web-based applications, including React Native, React, Angular, and Vue.js, to facilitate a seamless user experience at the front end"
     },
      {
       "project_type": "Data science",
       "text": "Once the app is developed, we conduct comprehensive testing to ensure that it is bug-free and performs well under various conditions Set Notification Frequency. Choose how often they receive updates—be it instant alerts, daily digests, or weekly summaries Personalize Content. Receive notifications relevant to their interests and activities on the platform"
     },
      {
       "project_type": "Enhanced customer engagement",
       "text": "A well-designed app provides a direct line of communication between your business and its customers"
     },
      {
       "project_type": "Increased revenue",
       "text": "Mobile apps can drive additional revenue streams by offering in-app purchases, subscriptions, or additional services"
     },
      {
       "project_type": "Competitive advantage",
       "text": "Having a custom mobile app gives you a unique edge over competitors who may not yet be in the mobile space"
     },
      {
       "project_type": "Scalability",
       "text": "A mobile app grows with your business, allowing you to adapt to changing market conditions"
     },
      {
       "project_type": "Cost efficiency",
       "text": "The cost of mobile app development is offset by the long-term benefits, including increased sales and customer loyalty"
     }
    ]
  },

    "how_it_staff_cms": {
    "title": "Developing a website based on an existing CMS",
    "text_title": "We leverage popular CMS platforms to build websites that are both functional and easy to manage with minimal effort. Our professional developers can further customize a content management system to implement new features and ensure top-notch performance optimization to suit your business goals",
    "descriptions": [
          {
       "project_type": "WordPress",
       "text": "WordPress is a versatile CMS that powers millions of websites worldwide, known for its user-friendly interface and extensive plug-in ecosystem. At Godev, we create tailored WordPress solutions that enhance your site’s functionality and design"
     },
      {
       "project_type": "Magento",
       "text": "Magento is an e-commerce CMS solution that provides powerful tools for managing online stores, offering extensive customization and scalability. Our team develops Magento-based websites that optimize your online sales experience while ensuring seamless performance and great search engine optimization"
     },
      {
       "project_type": "Drupal",
       "text": "Drupal is a robust CMS known for its flexibility and security, making it ideal for complex websites and applications. We utilize Drupal’s capabilities to create highly customizable and scalable solutions with custom features and addons tailored to your needs"
     },
      {
       "project_type": "Joomla",
       "text": "Joomla offers a balance between user-friendly web designs and powerful features, making it suitable for a variety of websites. Our Joomla development services focus on creating dynamic and engaging sites that are easy to manage and update"
     }
    ]
  },

    "how_it_staff_framework": {
    "title": "Advantages of development on frameworks",
    "descriptions": [
          {
       "project_type": "Speed",
       "text": "Frameworks enable developers to build applications quickly and efficiently by providing ready-made components and structures"
     },
      {
       "project_type": "Consistency",
       "text": "They enforce uniform coding standards, improving collaboration and simplifying code maintenance"
     },
      {
       "project_type": "Functionality",
       "text": "Built-in features expand app capabilities, minimizing custom coding for tasks like database integration and session management"
     },
      {
       "project_type": "Security",
       "text": "Many frameworks include security features that protect against common threats, ensuring data safety"
     },
      {
       "project_type": "Community support",
       "text": "Open-source frameworks benefit from active communities offering updates, plugins, and support, increasing reliability and innovation"
     }
    ]
  },

    "how_it_staff_b2b": {
    "title": "B2B e-commerce platforms",
    "descriptions": [
          {
       "project_type": "Magento",
       "text": "Renowned for its flexibility and scalability, Magento is ideal for businesses seeking a customizable solution that can grow with their needs. Its extensive library of extensions and modules allows for tailored functionality, making it a preferred choice for large-scale enterprises"
     },
      {
       "project_type": "Shopify",
       "text": "Known for its user-friendly interface and robust features, Shopify is a popular choice for businesses aiming for a quick and efficient online store setup. Its cloud-based architecture ensures reliable performance and scalability, while its vast app marketplace provides additional tools to optimize sales"
     },
      {
       "project_type": "WooCommerce",
       "text": "As a WordPress plugin, WooCommerce offers seamless integration for businesses already utilizing WordPress, providing a cost-effective and customizable eCommerce solution. Its open-source nature allows for extensive customization, making it an excellent option for small to medium-sized enterprises seeking control over their online store"
     },
      {
       "project_type": "WordPress",
       "text": "Beyond blogging, WordPress serves as a versatile platform for developing dynamic websites, including eCommerce functionalities through various plugins. Its global community of developers ensures consistent updates and a wide range of themes and plugins, enabling businesses to create engaging and functional websites with ease"
     }
    ]
  },

    "how_it_staff_design": {
    "title": "Custom design solutions",
    "descriptions": [
          {
       "project_type": "UX / UI",
       "text": "Godev is responsible for designing any user interface. A team of professional designers with extensive experience developing mobile applications, websites, CMS, and software. We create user-friendly and beautiful digital products"
     },
      {
       "project_type": "Corporate style",
       "text": "From the construction of the logo to the creation of the corporate identity design. We will create a unique and vibrant image for your company"
     },
      {
       "project_type": "Responsive layouts",
       "text": "Our specialists build interface layouts that can be used on both personal computers and mobile devices, meticulously testing the software to ensure the platform is comfortable and optimized"
     },
      {
       "project_type": "Better engagement",
       "text": "Godev can optimize all aspects of an online platform, starting with its aesthetics and ending with SEO. As a result, the business gets a higher discoverability in search engines and shows better conversion metrics among new users"
     },
      {
       "project_type": "Innovative visual elements",
       "text": "Our team is always on the lookout for innovations, and we carefully implement them to achieve a modern feeling and fresh aesthetics of any project"
     }
    ]
  },

    "how_it_staff_landing": {
    "title": "How a landing page helps your business",
    "text_section": "A strategically crafted landing page amplifies your marketing campaigns and aligns with your overall digital goals. Here’s how it benefits your business:",
    "descriptions": [
      {
       "project_type": "Generate more leads",
       "text": "With a tailored CTA and interactive features, landing pages capture leads effectively"
     },
      {
       "project_type": "Increase lead quality",
       "text": "By personalizing content and forms, businesses can gather high-quality leads tailored to specific campaign goals"
     },
      {
       "project_type": "Provide additional insights",
       "text": "Tools like calculators and forms help gather in-depth data on your audience, guiding future strategies"
     },
      {
       "project_type": "Boost SEO performance",
       "text": "Pages designed with SEO in mind attract organic traffic and improve your online visibility"
     },
      {
       "project_type": "Enhance conversion rates",
       "text": "Optimized landing page design and development ensures a seamless user experience, boosting customer confidence and action rates"
     }
    ]
  },

    "app_and_web_services_main": {
    "title": "App and Web Development Services",
    "text_section": "With a development team of 80 in-house specialists, we provide a variety of services related to online business practices, starting from web design and ending with creating brand-new downloadable apps",
    "descriptions": [
      {
       "project_type": "Custom web design",
       "text": "We create a custom website tailored to your specific needs, whether it is an online store, an informational web portal, or just a landing page that serves as a virtual visiting card for your business"
     },
      {
       "project_type": "Web applications",
       "text": "Our team can develop a web app that would fulfill all the needs of your enterprise. The software will be fully customizable, allowing you to bring your exact vision to life"
     },
      {
       "project_type": "Mobile applications",
       "text": "Our development agency creates downloadable apps for mobile devices to make your business easier to access on the go. We work with Android, iOS, and other portable operating systems"
     },
      {
       "project_type": "Web development",
       "text": "We provide other web development services depending on your individual needs. We can redesign an app’s interface, optimize a new website, or help you configure the CMS"
     },
      {
       "project_type": "Support and maintenance",
       "text": "We will ensure the uninterrupted operation of your website or application. Quick execution of content tasks, antivirus protection, version backups, software updates, design and code revision"
     },
      {
       "project_type": "Software development",
       "text": "Our team provides other software development services depending on your needs, starting with creating web applications and ending with developing other interactive elements for your website"
     },
      {
       "project_type": "Web development services",
       "text": "Godev builds websites seamlessly combining flawless visuals with powerful features, impressing the visitors with aesthetics. We also create individual web products of any kind to match the demands of your company"
     },
      {
       "project_type": "E-commerce web development",
       "text": "Elevate your online business with customized e-commerce solutions designed to maximize sales, enhance user experience, and drive sustainable growth"
     },
      {
       "project_type": "Website design and development services",
       "text": "Godev delivers the full scope of services, carefully crafting and customizing the designs to make eye-pleasing and high-performance platforms for our clients. We approach every project individually, adjusting every detail to fit the brand’s unique image"
     },
      {
       "project_type": "Outstaffing and outsourcing",
       "text": "Scaling digital teams. Convenient cooperation format and transparent approach"
     },
      {
       "project_type": "B2B sites",
       "text": "In the rapidly evolving digital landscape, a robust B2B website is essential for businesses aiming to enhance their online presence and drive growth. At Godev, a leading B2B eCommerce agency in the USA, we specialize in crafting tailored web development solutions that align with your business objectives"
     }
    ]
  },

    "app_and_web_services_service": {
    "title": "App and Web Development Services",
    "text_section": "With a development team of 80 in-house specialists, we provide a variety of services related to online business practices, starting from web design and ending with creating brand-new downloadable apps",
    "descriptions": [
      {
       "project_type": "Custom web design",
       "text": "We create a custom website tailored to your specific needs, whether it is an online store, an informational web portal, or just a landing page that serves as a virtual visiting card for your business"
     },
      {
       "project_type": "Web applications",
       "text": "Our team can develop a web app that would fulfill all the needs of your enterprise. The software will be fully customizable, allowing you to bring your exact vision to life"
     },
      {
       "project_type": "Mobile applications",
       "text": "Our development agency creates downloadable apps for mobile devices to make your business easier to access on the go. We work with Android, iOS, and other portable operating systems"
     },
      {
       "project_type": "Web development",
       "text": "We provide other web development services depending on your individual needs. We can redesign an app’s interface, optimize a new website, or help you configure the CMS"
     },
      {
       "project_type": "Support and maintenance",
       "text": "We will ensure the uninterrupted operation of your website or application. Quick execution of content tasks, antivirus protection, version backups, software updates, design and code revision"
     },
      {
       "project_type": "Software development",
       "text": "Our team provides other software development services depending on your needs, starting with creating web applications and ending with developing other interactive elements for your website"
     },
      {
       "project_type": "Web development services",
       "text": "Godev builds websites seamlessly combining flawless visuals with powerful features, impressing the visitors with aesthetics. We also create individual web products of any kind to match the demands of your company"
     },
      {
       "project_type": "E-commerce web development",
       "text": "Elevate your online business with customized e-commerce solutions designed to maximize sales, enhance user experience, and drive sustainable growth"
     },
      {
       "project_type": "Website design and development services",
       "text": "Godev delivers the full scope of services, carefully crafting and customizing the designs to make eye-pleasing and high-performance platforms for our clients. We approach every project individually, adjusting every detail to fit the brand’s unique image"
     },
      {
       "project_type": "Outstaffing and outsourcing",
       "text": "Scaling digital teams. Convenient cooperation format and transparent approach"
     }
    ]
  },

    "convenient_cooperation_outstaff": {
    "title": "Convenient cooperation formats for increased benefits and efficiency",
    "descriptions": [
      {
       "project_type": "FTE",
       "text": " "
     },
      {
       "project_type": "T&M",
       "text": "Hourly wage"
     },
      {
       "project_type": "Mixed",
       "text": "if acquired employees are insufficient"
     },
      {
       "project_type": "Project work",
       "text": "Involve a specialist with required skills for a specific project"
     }

    ]
  },

    "advantages_of_outsourcing_framework": {
    "title": "Advantages of outsourcing for web development on frameworks",
    "text": "Outsourcing web development to a specialized company like Godev presents several advantages:",
    "descriptions": [
      {
       "project_type": "Cost savings",
       "text": "Reduces expenses associated with hiring, training, and maintaining an in-house development team, allowing businesses to allocate resources more effectively"
     },
      {
       "project_type": "Expertise access",
       "text": "Provides access to professional developers with extensive experience in various development frameworks, ensuring high-quality outcomes"
     },
      {
       "project_type": "Focus on core activities",
       "text": "Enables businesses to concentrate on their core competencies while the technical aspects of development are managed externally"
     },
      {
       "project_type": "Scalability and flexibility",
       "text": "Offers the ability to scale the development team up or down based on project requirements, providing flexibility to meet changing needs"
     },
      {
       "project_type": "Quality assurance",
       "text": "Professional outsourcing firms implement rigorous testing and quality control measures, reducing the likelihood of bugs and enhancing reliability"
     }
    ]
  },

    "convenient_of_outstaffing": {
    "title": "Convenient cooperation formats for increased benefits and efficiency",
    "descriptions": [
      {
       "project_type": "FTE",
       "text": "Acquire full-time equivalent staff"
     },
      {
       "project_type": "T&M",
       "text": "Hourly wage"
     },
      {
       "project_type": "Mixed",
       "text": "if acquired employees are insufficient"
     },
      {
       "project_type": "Project work",
       "text": "Involve a specialist with required skills for a specific project"
     }
    ]
  }
}